Revit 2024 API
LayerModifier Constructor (ModifierType, String)
 Constructs a new LayerModifier with modifierType and separator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public LayerModifier(
	ModifierType modifierType,
	string separator
)
Visual Basic
Public Sub New ( _
	modifierType As ModifierType, _
	separator As String _
)
Visual C++
public:
LayerModifier(
	ModifierType modifierType,
	String^ separator
)
Parameters
modifierType
Type: Autodesk.Revit.DB.ModifierType
 The modifier type.
separator
Type: System.String
 The separator string that will follow this modifier in the export layer name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The provided separator contains invalid characters (most special characters are invalid).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
LayerModifier Class
LayerModifier Overload
Autodesk.Revit.DB Namespace